# AlternateUnitsPrefix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlternateUnitsPrefix Property
ParameterTypeId Class See Also
---
"Alternate Units Prefix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlternateUnitsPrefix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlternateUnitsPrefix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlternateUnitsPrefix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace